GopalSaraf/Practicals/PSDL/include/proc/pic16lf1717.inc
// Register: DAC1CON0
#define DAC1CON0 DAC1CON0
DAC1CON0                                 equ 0118h
// bitfield definitions
DAC1CON0_DAC1NSS_POSN                    equ 0000h
DAC1CON0_DAC1NSS_POSITION                equ 0000h
DAC1CON0_DAC1NSS_SIZE                    equ 0001h
DAC1CON0_DAC1NSS_LENGTH                  equ 0001h
DAC1CON0_DAC1NSS_MASK                    equ 0001h
DAC1CON0_DAC1PSS_POSN                    equ 0002h
DAC1CON0_DAC1PSS_POSITION                equ 0002h
DAC1CON0_DAC1PSS_SIZE                    equ 0002h
DAC1CON0_DAC1PSS_LENGTH                  equ 0002h
DAC1CON0_DAC1PSS_MASK                    equ 000Ch
DAC1CON0_DAC1OE2_POSN                    equ 0004h
DAC1CON0_DAC1OE2_POSITION                equ 0004h
DAC1CON0_DAC1OE2_SIZE                    equ 0001h
DAC1CON0_DAC1OE2_LENGTH                  equ 0001h
DAC1CON0_DAC1OE2_MASK                    equ 0010h
DAC1CON0_DAC1OE1_POSN                    equ 0005h
DAC1CON0_DAC1OE1_POSITION                equ 0005h
DAC1CON0_DAC1OE1_SIZE                    equ 0001h
DAC1CON0_DAC1OE1_LENGTH                  equ 0001h
DAC1CON0_DAC1OE1_MASK                    equ 0020h
DAC1CON0_DAC1EN_POSN                     equ 0007h
DAC1CON0_DAC1EN_POSITION                 equ 0007h
DAC1CON0_DAC1EN_SIZE                     equ 0001h
DAC1CON0_DAC1EN_LENGTH                   equ 0001h
DAC1CON0_DAC1EN_MASK                     equ 0080h
DAC1CON0_DAC1PSS0_POSN                   equ 0002h
DAC1CON0_DAC1PSS0_POSITION               equ 0002h
DAC1CON0_DAC1PSS0_SIZE                   equ 0001h
DAC1CON0_DAC1PSS0_LENGTH                 equ 0001h
DAC1CON0_DAC1PSS0_MASK                   equ 0004h
DAC1CON0_DAC1PSS1_POSN                   equ 0003h
DAC1CON0_DAC1PSS1_POSITION               equ 0003h
DAC1CON0_DAC1PSS1_SIZE                   equ 0001h
DAC1CON0_DAC1PSS1_LENGTH                 equ 0001h
DAC1CON0_DAC1PSS1_MASK                   equ 0008h
DAC1CON0_DACNSS_POSN                     equ 0000h
DAC1CON0_DACNSS_POSITION                 equ 0000h
DAC1CON0_DACNSS_SIZE                     equ 0001h
DAC1CON0_DACNSS_LENGTH                   equ 0001h
DAC1CON0_DACNSS_MASK                     equ 0001h
DAC1CON0_DACPSS_POSN                     equ 0002h
DAC1CON0_DACPSS_POSITION                 equ 0002h
DAC1CON0_DACPSS_SIZE                     equ 0002h
DAC1CON0_DACPSS_LENGTH                   equ 0002h
DAC1CON0_DACPSS_MASK                     equ 000Ch
DAC1CON0_DACOE0_POSN                     equ 0004h
DAC1CON0_DACOE0_POSITION                 equ 0004h
DAC1CON0_DACOE0_SIZE                     equ 0001h
DAC1CON0_DACOE0_LENGTH                   equ 0001h
DAC1CON0_DACOE0_MASK                     equ 0010h
DAC1CON0_DACOE1_POSN                     equ 0005h
DAC1CON0_DACOE1_POSITION                 equ 0005h
DAC1CON0_DACOE1_SIZE                     equ 0001h
DAC1CON0_DACOE1_LENGTH                   equ 0001h
DAC1CON0_DACOE1_MASK                     equ 0020h
DAC1CON0_DACEN_POSN                      equ 0007h
DAC1CON0_DACEN_POSITION                  equ 0007h
DAC1CON0_DACEN_SIZE                      equ 0001h
DAC1CON0_DACEN_LENGTH                    equ 0001h
DAC1CON0_DACEN_MASK                      equ 0080h
DAC1CON0_DACPSS0_POSN                    equ 0002h
DAC1CON0_DACPSS0_POSITION                equ 0002h
DAC1CON0_DACPSS0_SIZE                    equ 0001h
DAC1CON0_DACPSS0_LENGTH                  equ 0001h
DAC1CON0_DACPSS0_MASK                    equ 0004h
DAC1CON0_DACPSS1_POSN                    equ 0003h
DAC1CON0_DACPSS1_POSITION                equ 0003h
DAC1CON0_DACPSS1_SIZE                    equ 0001h
DAC1CON0_DACPSS1_LENGTH                  equ 0001h
DAC1CON0_DACPSS1_MASK                    equ 0008h

// Register: DAC1CON1
#define DAC1CON1 DAC1CON1
DAC1CON1                                 equ 0119h
// bitfield definitions
DAC1CON1_DAC1R_POSN                      equ 0000h
DAC1CON1_DAC1R_POSITION                  equ 0000h
DAC1CON1_DAC1R_SIZE                      equ 0008h
DAC1CON1_DAC1R_LENGTH                    equ 0008h
DAC1CON1_DAC1R_MASK                      equ 00FFh
DAC1CON1_DAC1R0_POSN                     equ 0000h
DAC1CON1_DAC1R0_POSITION                 equ 0000h
DAC1CON1_DAC1R0_SIZE                     equ 0001h
DAC1CON1_DAC1R0_LENGTH                   equ 0001h
DAC1CON1_DAC1R0_MASK                     equ 0001h
DAC1CON1_DAC1R1_POSN                     equ 0001h
DAC1CON1_DAC1R1_POSITION                 equ 0001h
DAC1CON1_DAC1R1_SIZE                     equ 0001h
DAC1CON1_DAC1R1_LENGTH                   equ 0001h
DAC1CON1_DAC1R1_MASK                     equ 0002h
DAC1CON1_DAC1R2_POSN                     equ 0002h
DAC1CON1_DAC1R2_POSITION                 equ 0002h
DAC1CON1_DAC1R2_SIZE                     equ 0001h
DAC1CON1_DAC1R2_LENGTH                   equ 0001h
DAC1CON1_DAC1R2_MASK                     equ 0004h
DAC1CON1_DAC1R3_POSN                     equ 0003h
DAC1CON1_DAC1R3_POSITION                 equ 0003h
DAC1CON1_DAC1R3_SIZE                     equ 0001h
DAC1CON1_DAC1R3_LENGTH                   equ 0001h
DAC1CON1_DAC1R3_MASK                     equ 0008h
DAC1CON1_DAC1R4_POSN                     equ 0004h
DAC1CON1_DAC1R4_POSITION                 equ 0004h
DAC1CON1_DAC1R4_SIZE                     equ 0001h
DAC1CON1_DAC1R4_LENGTH                   equ 0001h
DAC1CON1_DAC1R4_MASK                     equ 0010h
DAC1CON1_DAC1R5_POSN                     equ 0005h
DAC1CON1_DAC1R5_POSITION                 equ 0005h
DAC1CON1_DAC1R5_SIZE                     equ 0001h
DAC1CON1_DAC1R5_LENGTH                   equ 0001h
DAC1CON1_DAC1R5_MASK                     equ 0020h
DAC1CON1_DAC1R6_POSN                     equ 0006h
DAC1CON1_DAC1R6_POSITION                 equ 0006h
DAC1CON1_DAC1R6_SIZE                     equ 0001h
DAC1CON1_DAC1R6_LENGTH                   equ 0001h
DAC1CON1_DAC1R6_MASK                     equ 0040h
DAC1CON1_DAC1R7_POSN                     equ 0007h
DAC1CON1_DAC1R7_POSITION                 equ 0007h
DAC1CON1_DAC1R7_SIZE                     equ 0001h
DAC1CON1_DAC1R7_LENGTH                   equ 0001h
DAC1CON1_DAC1R7_MASK                     equ 0080h
DAC1CON1_DACR0_POSN                      equ 0000h
DAC1CON1_DACR0_POSITION                  equ 0000h
DAC1CON1_DACR0_SIZE                      equ 0001h
DAC1CON1_DACR0_LENGTH                    equ 0001h
DAC1CON1_DACR0_MASK                      equ 0001h
DAC1CON1_DACR1_POSN                      equ 0001h
DAC1CON1_DACR1_POSITION                  equ 0001h
DAC1CON1_DACR1_SIZE                      equ 0001h
DAC1CON1_DACR1_LENGTH                    equ 0001h
DAC1CON1_DACR1_MASK                      equ 0002h
DAC1CON1_DACR2_POSN                      equ 0002h
DAC1CON1_DACR2_POSITION                  equ 0002h
DAC1CON1_DACR2_SIZE                      equ 0001h
DAC1CON1_DACR2_LENGTH                    equ 0001h
DAC1CON1_DACR2_MASK                      equ 0004h
DAC1CON1_DACR3_POSN                      equ 0003h
DAC1CON1_DACR3_POSITION                  equ 0003h
DAC1CON1_DACR3_SIZE                      equ 0001h
DAC1CON1_DACR3_LENGTH                    equ 0001h
DAC1CON1_DACR3_MASK                      equ 0008h
DAC1CON1_DACR4_POSN                      equ 0004h
DAC1CON1_DACR4_POSITION                  equ 0004h
DAC1CON1_DACR4_SIZE                      equ 0001h
DAC1CON1_DACR4_LENGTH                    equ 0001h
DAC1CON1_DACR4_MASK                      equ 0010h
DAC1CON1_DACR5_POSN                      equ 0005h
DAC1CON1_DACR5_POSITION                  equ 0005h
DAC1CON1_DACR5_SIZE                      equ 0001h
DAC1CON1_DACR5_LENGTH                    equ 0001h
DAC1CON1_DACR5_MASK                      equ 0020h
DAC1CON1_DACR6_POSN                      equ 0006h
DAC1CON1_DACR6_POSITION                  equ 0006h
DAC1CON1_DACR6_SIZE                      equ 0001h
DAC1CON1_DACR6_LENGTH                    equ 0001h
DAC1CON1_DACR6_MASK                      equ 0040h
DAC1CON1_DACR7_POSN                      equ 0007h
DAC1CON1_DACR7_POSITION                  equ 0007h
DAC1CON1_DACR7_SIZE                      equ 0001h
DAC1CON1_DACR7_LENGTH                    equ 0001h
DAC1CON1_DACR7_MASK                      equ 0080h

// Register: DAC2CON0
#define DAC2CON0 DAC2CON0
DAC2CON0                                 equ 011Ah
// bitfield definitions
DAC2CON0_NSS_POSN                        equ 0000h
DAC2CON0_NSS_POSITION                    equ 0000h
DAC2CON0_NSS_SIZE                        equ 0001h
DAC2CON0_NSS_LENGTH                      equ 0001h
DAC2CON0_NSS_MASK                        equ 0001h
DAC2CON0_PSS_POSN                        equ 0002h
DAC2CON0_PSS_POSITION                    equ 0002h
DAC2CON0_PSS_SIZE                        equ 0002h
DAC2CON0_PSS_LENGTH                      equ 0002h
DAC2CON0_PSS_MASK                        equ 000Ch
DAC2CON0_OE2_POSN                        equ 0004h
DAC2CON0_OE2_POSITION                    equ 0004h
DAC2CON0_OE2_SIZE                        equ 0001h
DAC2CON0_OE2_LENGTH                      equ 0001h
DAC2CON0_OE2_MASK                        equ 0010h
DAC2CON0_OE1_POSN                        equ 0005h
DAC2CON0_OE1_POSITION                    equ 0005h
DAC2CON0_OE1_SIZE                        equ 0001h
DAC2CON0_OE1_LENGTH                      equ 0001h
DAC2CON0_OE1_MASK                        equ 0020h
DAC2CON0_EN_POSN                         equ 0007h
DAC2CON0_EN_POSITION                     equ 0007h
DAC2CON0_EN_SIZE                         equ 0001h
DAC2CON0_EN_LENGTH                       equ 0001h
DAC2CON0_EN_MASK                         equ 0080h
DAC2CON0_PSS0_POSN                       equ 0002h
DAC2CON0_PSS0_POSITION                   equ 0002h
DAC2CON0_PSS0_SIZE                       equ 0001h
DAC2CON0_PSS0_LENGTH                     equ 0001h
DAC2CON0_PSS0_MASK                       equ 0004h
DAC2CON0_PSS1_POSN                       equ 0003h
DAC2CON0_PSS1_POSITION                   equ 0003h
DAC2CON0_PSS1_SIZE                       equ 0001h
DAC2CON0_PSS1_LENGTH                     equ 0001h
DAC2CON0_PSS1_MASK                       equ 0008h
DAC2CON0_DACNSS_POSN                     equ 0000h
DAC2CON0_DACNSS_POSITION                 equ 0000h
DAC2CON0_DACNSS_SIZE                     equ 0001h
DAC2CON0_DACNSS_LENGTH                   equ 0001h
DAC2CON0_DACNSS_MASK                     equ 0001h
DAC2CON0_DACPSS_POSN                     equ 0002h
DAC2CON0_DACPSS_POSITION                 equ 0002h
DAC2CON0_DACPSS_SIZE                     equ 0002h
DAC2CON0_DACPSS_LENGTH                   equ 0002h
DAC2CON0_DACPSS_MASK                     equ 000Ch
DAC2CON0_DACOE2_POSN                     equ 0004h
DAC2CON0_DACOE2_POSITION                 equ 0004h
DAC2CON0_DACOE2_SIZE                     equ 0001h
DAC2CON0_DACOE2_LENGTH                   equ 0001h
DAC2CON0_DACOE2_MASK                     equ 0010h
DAC2CON0_DACOE1_POSN                     equ 0005h
DAC2CON0_DACOE1_POSITION                 equ 0005h
DAC2CON0_DACOE1_SIZE                     equ 0001h
DAC2CON0_DACOE1_LENGTH                   equ 0001h
DAC2CON0_DACOE1_MASK                     equ 0020h
DAC2CON0_DACEN_POSN                      equ 0007h
DAC2CON0_DACEN_POSITION                  equ 0007h
DAC2CON0_DACEN_SIZE                      equ 0001h
DAC2CON0_DACEN_LENGTH                    equ 0001h
DAC2CON0_DACEN_MASK                      equ 0080h
DAC2CON0_DACPSS0_POSN                    equ 0002h
DAC2CON0_DACPSS0_POSITION                equ 0002h
DAC2CON0_DACPSS0_SIZE                    equ 0001h
DAC2CON0_DACPSS0_LENGTH                  equ 0001h
DAC2CON0_DACPSS0_MASK                    equ 0004h
DAC2CON0_DACPSS1_POSN                    equ 0003h
DAC2CON0_DACPSS1_POSITION                equ 0003h
DAC2CON0_DACPSS1_SIZE                    equ 0001h
DAC2CON0_DACPSS1_LENGTH                  equ 0001h
DAC2CON0_DACPSS1_MASK                    equ 0008h
DAC2CON0_DAC2NSS_POSN                    equ 0000h
DAC2CON0_DAC2NSS_POSITION                equ 0000h
DAC2CON0_DAC2NSS_SIZE                    equ 0001h
DAC2CON0_DAC2NSS_LENGTH                  equ 0001h
DAC2CON0_DAC2NSS_MASK                    equ 0001h
DAC2CON0_DAC2PSS_POSN                    equ 0002h
DAC2CON0_DAC2PSS_POSITION                equ 0002h
DAC2CON0_DAC2PSS_SIZE                    equ 0002h
DAC2CON0_DAC2PSS_LENGTH                  equ 0002h
DAC2CON0_DAC2PSS_MASK                    equ 000Ch
DAC2CON0_DAC2OE2_POSN                    equ 0004h
DAC2CON0_DAC2OE2_POSITION                equ 0004h
DAC2CON0_DAC2OE2_SIZE                    equ 0001h
DAC2CON0_DAC2OE2_LENGTH                  equ 0001h
DAC2CON0_DAC2OE2_MASK                    equ 0010h
DAC2CON0_DAC2OE1_POSN                    equ 0005h
DAC2CON0_DAC2OE1_POSITION                equ 0005h
DAC2CON0_DAC2OE1_SIZE                    equ 0001h
DAC2CON0_DAC2OE1_LENGTH                  equ 0001h
DAC2CON0_DAC2OE1_MASK                    equ 0020h
DAC2CON0_DAC2EN_POSN                     equ 0007h
DAC2CON0_DAC2EN_POSITION                 equ 0007h
DAC2CON0_DAC2EN_SIZE                     equ 0001h
DAC2CON0_DAC2EN_LENGTH                   equ 0001h
DAC2CON0_DAC2EN_MASK                     equ 0080h
DAC2CON0_DAC2PSS0_POSN                   equ 0002h
DAC2CON0_DAC2PSS0_POSITION               equ 0002h
DAC2CON0_DAC2PSS0_SIZE                   equ 0001h
DAC2CON0_DAC2PSS0_LENGTH                 equ 0001h
DAC2CON0_DAC2PSS0_MASK                   equ 0004h
DAC2CON0_DAC2PSS1_POSN                   equ 0003h
DAC2CON0_DAC2PSS1_POSITION               equ 0003h
DAC2CON0_DAC2PSS1_SIZE                   equ 0001h
DAC2CON0_DAC2PSS1_LENGTH                 equ 0001h
DAC2CON0_DAC2PSS1_MASK                   equ 0008h

// Register: DAC2REF
#define DAC2REF DAC2REF
DAC2REF                                  equ 011Bh
// bitfield definitions
DAC2REF_DACR_POSN                        equ 0000h
DAC2REF_DACR_POSITION                    equ 0000h
DAC2REF_DACR_SIZE                        equ 0005h
DAC2REF_DACR_LENGTH                      equ 0005h
DAC2REF_DACR_MASK                        equ 001Fh
DAC2REF_DACR0_POSN                       equ 0000h
DAC2REF_DACR0_POSITION                   equ 0000h
DAC2REF_DACR0_SIZE                       equ 0001h
DAC2REF_DACR0_LENGTH                     equ 0001h
DAC2REF_DACR0_MASK                       equ 0001h
DAC2REF_DACR1_POSN                       equ 0001h
DAC2REF_DACR1_POSITION                   equ 0001h
DAC2REF_DACR1_SIZE                       equ 0001h
DAC2REF_DACR1_LENGTH                     equ 0001h
DAC2REF_DACR1_MASK                       equ 0002h
DAC2REF_DACR2_POSN                       equ 0002h
DAC2REF_DACR2_POSITION                   equ 0002h
DAC2REF_DACR2_SIZE                       equ 0001h
DAC2REF_DACR2_LENGTH                     equ 0001h
DAC2REF_DACR2_MASK                       equ 0004h
DAC2REF_DACR3_POSN                       equ 0003h
DAC2REF_DACR3_POSITION                   equ 0003h
DAC2REF_DACR3_SIZE                       equ 0001h
DAC2REF_DACR3_LENGTH                     equ 0001h
DAC2REF_DACR3_MASK                       equ 0008h
DAC2REF_DACR4_POSN                       equ 0004h
DAC2REF_DACR4_POSITION                   equ 0004h
DAC2REF_DACR4_SIZE                       equ 0001h
DAC2REF_DACR4_LENGTH                     equ 0001h
DAC2REF_DACR4_MASK                       equ 0010h
DAC2REF_R0_POSN                          equ 0000h
DAC2REF_R0_POSITION                      equ 0000h
DAC2REF_R0_SIZE                          equ 0001h
DAC2REF_R0_LENGTH                        equ 0001h
DAC2REF_R0_MASK                          equ 0001h
DAC2REF_R1_POSN                          equ 0001h
DAC2REF_R1_POSITION                      equ 0001h
DAC2REF_R1_SIZE                          equ 0001h
DAC2REF_R1_LENGTH                        equ 0001h
DAC2REF_R1_MASK                          equ 0002h
DAC2REF_R2_POSN                          equ 0002h
DAC2REF_R2_POSITION                      equ 0002h
DAC2REF_R2_SIZE                          equ 0001h
DAC2REF_R2_LENGTH                        equ 0001h
DAC2REF_R2_MASK                          equ 0004h
DAC2REF_R3_POSN                          equ 0003h
DAC2REF_R3_POSITION                      equ 0003h
DAC2REF_R3_SIZE                          equ 0001h
DAC2REF_R3_LENGTH                        equ 0001h
DAC2REF_R3_MASK                          equ 0008h
DAC2REF_R4_POSN                          equ 0004h
DAC2REF_R4_POSITION                      equ 0004h
DAC2REF_R4_SIZE                          equ 0001h
DAC2REF_R4_LENGTH                        equ 0001h
DAC2REF_R4_MASK                          equ 0010h
DAC2REF_DAC2R_POSN                       equ 0000h
DAC2REF_DAC2R_POSITION                   equ 0000h
DAC2REF_DAC2R_SIZE                       equ 0005h
DAC2REF_DAC2R_LENGTH                     equ 0005h
DAC2REF_DAC2R_MASK                       equ 001Fh
DAC2REF_DAC2R0_POSN                      equ 0000h
DAC2REF_DAC2R0_POSITION                  equ 0000h
DAC2REF_DAC2R0_SIZE                      equ 0001h
DAC2REF_DAC2R0_LENGTH                    equ 0001h
DAC2REF_DAC2R0_MASK                      equ 0001h
DAC2REF_DAC2R1_POSN                      equ 0001h
DAC2REF_DAC2R1_POSITION                  equ 0001h
DAC2REF_DAC2R1_SIZE                      equ 0001h
DAC2REF_DAC2R1_LENGTH                    equ 0001h
DAC2REF_DAC2R1_MASK                      equ 0002h
DAC2REF_DAC2R2_POSN                      equ 0002h
DAC2REF_DAC2R2_POSITION                  equ 0002h
DAC2REF_DAC2R2_SIZE                      equ 0001h
DAC2REF_DAC2R2_LENGTH                    equ 0001h
DAC2REF_DAC2R2_MASK                      equ 0004h
DAC2REF_DAC2R3_POSN                      equ 0003h
DAC2REF_DAC2R3_POSITION                  equ 0003h
DAC2REF_DAC2R3_SIZE                      equ 0001h
DAC2REF_DAC2R3_LENGTH                    equ 0001h
DAC2REF_DAC2R3_MASK                      equ 0008h
DAC2REF_DAC2R4_POSN                      equ 0004h
DAC2REF_DAC2R4_POSITION                  equ 0004h
DAC2REF_DAC2R4_SIZE                      equ 0001h
DAC2REF_DAC2R4_LENGTH                    equ 0001h
DAC2REF_DAC2R4_MASK                      equ 0010h
DAC2REF_REF0_POSN                        equ 0000h
DAC2REF_REF0_POSITION                    equ 0000h
DAC2REF_REF0_SIZE                        equ 0001h
DAC2REF_REF0_LENGTH                      equ 0001h
DAC2REF_REF0_MASK                        equ 0001h
DAC2REF_REF1_POSN                        equ 0001h
DAC2REF_REF1_POSITION                    equ 0001h
DAC2REF_REF1_SIZE                        equ 0001h
DAC2REF_REF1_LENGTH                      equ 0001h
DAC2REF_REF1_MASK                        equ 0002h
DAC2REF_REF2_POSN                        equ 0002h
DAC2REF_REF2_POSITION                    equ 0002h
DAC2REF_REF2_SIZE                        equ 0001h
DAC2REF_REF2_LENGTH                      equ 0001h
DAC2REF_REF2_MASK                        equ 0004h
DAC2REF_REF3_POSN                        equ 0003h
DAC2REF_REF3_POSITION                    equ 0003h
DAC2REF_REF3_SIZE                        equ 0001h
DAC2REF_REF3_LENGTH                      equ 0001h
DAC2REF_REF3_MASK                        equ 0008h
DAC2REF_REF4_POSN                        equ 0004h
DAC2REF_REF4_POSITION                    equ 0004h
DAC2REF_REF4_SIZE                        equ 0001h
DAC2REF_REF4_LENGTH                      equ 0001h
DAC2REF_REF4_MASK                        equ 0010h
DAC2REF_REF5_POSN                        equ 0005h
DAC2REF_REF5_POSITION                    equ 0005h
DAC2REF_REF5_SIZE                        equ 0001h
DAC2REF_REF5_LENGTH                      equ 0001h
DAC2REF_REF5_MASK                        equ 0020h
DAC2REF_DAC2REF0_POSN                    equ 0000h
DAC2REF_DAC2REF0_POSITION                equ 0000h
DAC2REF_DAC2REF0_SIZE                    equ 0001h
DAC2REF_DAC2REF0_LENGTH                  equ 0001h
DAC2REF_DAC2REF0_MASK                    equ 0001h
DAC2REF_DAC2REF1_POSN                    equ 0001h
DAC2REF_DAC2REF1_POSITION                equ 0001h
DAC2REF_DAC2REF1_SIZE                    equ 0001h
DAC2REF_DAC2REF1_LENGTH                  equ 0001h
DAC2REF_DAC2REF1_MASK                    equ 0002h
DAC2REF_DAC2REF2_POSN                    equ 0002h
DAC2REF_DAC2REF2_POSITION                equ 0002h
DAC2REF_DAC2REF2_SIZE                    equ 0001h
DAC2REF_DAC2REF2_LENGTH                  equ 0001h
DAC2REF_DAC2REF2_MASK                    equ 0004h
DAC2REF_DAC2REF3_POSN                    equ 0003h
DAC2REF_DAC2REF3_POSITION                equ 0003h
DAC2REF_DAC2REF3_SIZE                    equ 0001h
DAC2REF_DAC2REF3_LENGTH                  equ 0001h
DAC2REF_DAC2REF3_MASK                    equ 0008h
DAC2REF_DAC2REF4_POSN                    equ 0004h
DAC2REF_DAC2REF4_POSITION                equ 0004h
DAC2REF_DAC2REF4_SIZE                    equ 0001h
DAC2REF_DAC2REF4_LENGTH                  equ 0001h
DAC2REF_DAC2REF4_MASK                    equ 0010h
DAC2REF_DAC2REF5_POSN                    equ 0005h
DAC2REF_DAC2REF5_POSITION                equ 0005h
DAC2REF_DAC2REF5_SIZE                    equ 0001h
DAC2REF_DAC2REF5_LENGTH                  equ 0001h
DAC2REF_DAC2REF5_MASK                    equ 0020h

