GopalSaraf/Practicals/PSDL/include/proc/pic16lf1717.inc
// Register: ODCOND
#define ODCOND ODCOND
ODCOND                                   equ 028Fh
// bitfield definitions
ODCOND_ODD0_POSN                         equ 0000h
ODCOND_ODD0_POSITION                     equ 0000h
ODCOND_ODD0_SIZE                         equ 0001h
ODCOND_ODD0_LENGTH                       equ 0001h
ODCOND_ODD0_MASK                         equ 0001h
ODCOND_ODD1_POSN                         equ 0001h
ODCOND_ODD1_POSITION                     equ 0001h
ODCOND_ODD1_SIZE                         equ 0001h
ODCOND_ODD1_LENGTH                       equ 0001h
ODCOND_ODD1_MASK                         equ 0002h
ODCOND_ODD2_POSN                         equ 0002h
ODCOND_ODD2_POSITION                     equ 0002h
ODCOND_ODD2_SIZE                         equ 0001h
ODCOND_ODD2_LENGTH                       equ 0001h
ODCOND_ODD2_MASK                         equ 0004h
ODCOND_ODD3_POSN                         equ 0003h
ODCOND_ODD3_POSITION                     equ 0003h
ODCOND_ODD3_SIZE                         equ 0001h
ODCOND_ODD3_LENGTH                       equ 0001h
ODCOND_ODD3_MASK                         equ 0008h
ODCOND_ODD4_POSN                         equ 0004h
ODCOND_ODD4_POSITION                     equ 0004h
ODCOND_ODD4_SIZE                         equ 0001h
ODCOND_ODD4_LENGTH                       equ 0001h
ODCOND_ODD4_MASK                         equ 0010h
ODCOND_ODD5_POSN                         equ 0005h
ODCOND_ODD5_POSITION                     equ 0005h
ODCOND_ODD5_SIZE                         equ 0001h
ODCOND_ODD5_LENGTH                       equ 0001h
ODCOND_ODD5_MASK                         equ 0020h
ODCOND_ODD6_POSN                         equ 0006h
ODCOND_ODD6_POSITION                     equ 0006h
ODCOND_ODD6_SIZE                         equ 0001h
ODCOND_ODD6_LENGTH                       equ 0001h
ODCOND_ODD6_MASK                         equ 0040h
ODCOND_ODD7_POSN                         equ 0007h
ODCOND_ODD7_POSITION                     equ 0007h
ODCOND_ODD7_SIZE                         equ 0001h
ODCOND_ODD7_LENGTH                       equ 0001h
ODCOND_ODD7_MASK                         equ 0080h

// Register: ODCONE
#define ODCONE ODCONE
ODCONE                                   equ 0290h
// bitfield definitions
ODCONE_ODE0_POSN                         equ 0000h
ODCONE_ODE0_POSITION                     equ 0000h
ODCONE_ODE0_SIZE                         equ 0001h
ODCONE_ODE0_LENGTH                       equ 0001h
ODCONE_ODE0_MASK                         equ 0001h
ODCONE_ODE1_POSN                         equ 0001h
ODCONE_ODE1_POSITION                     equ 0001h
ODCONE_ODE1_SIZE                         equ 0001h
ODCONE_ODE1_LENGTH                       equ 0001h
ODCONE_ODE1_MASK                         equ 0002h
ODCONE_ODE2_POSN                         equ 0002h
ODCONE_ODE2_POSITION                     equ 0002h
ODCONE_ODE2_SIZE                         equ 0001h
ODCONE_ODE2_LENGTH                       equ 0001h
ODCONE_ODE2_MASK                         equ 0004h

// Register: CCPR1L
#define CCPR1L CCPR1L
CCPR1L                                   equ 0291h
// bitfield definitions
CCPR1L_CCPR1L_POSN                       equ 0000h
CCPR1L_CCPR1L_POSITION                   equ 0000h
CCPR1L_CCPR1L_SIZE                       equ 0008h
CCPR1L_CCPR1L_LENGTH                     equ 0008h
CCPR1L_CCPR1L_MASK                       equ 00FFh

// Register: CCPR1H
#define CCPR1H CCPR1H
CCPR1H                                   equ 0292h
// bitfield definitions
CCPR1H_CCPR1H_POSN                       equ 0000h
CCPR1H_CCPR1H_POSITION                   equ 0000h
CCPR1H_CCPR1H_SIZE                       equ 0008h
CCPR1H_CCPR1H_LENGTH                     equ 0008h
CCPR1H_CCPR1H_MASK                       equ 00FFh

// Register: CCP1CON
#define CCP1CON CCP1CON
CCP1CON                                  equ 0293h
// bitfield definitions
CCP1CON_CCP1M_POSN                       equ 0000h
CCP1CON_CCP1M_POSITION                   equ 0000h
CCP1CON_CCP1M_SIZE                       equ 0004h
CCP1CON_CCP1M_LENGTH                     equ 0004h
CCP1CON_CCP1M_MASK                       equ 000Fh
CCP1CON_DC1B_POSN                        equ 0004h
CCP1CON_DC1B_POSITION                    equ 0004h
CCP1CON_DC1B_SIZE                        equ 0002h
CCP1CON_DC1B_LENGTH                      equ 0002h
CCP1CON_DC1B_MASK                        equ 0030h
CCP1CON_CCP1M0_POSN                      equ 0000h
CCP1CON_CCP1M0_POSITION                  equ 0000h
CCP1CON_CCP1M0_SIZE                      equ 0001h
CCP1CON_CCP1M0_LENGTH                    equ 0001h
CCP1CON_CCP1M0_MASK                      equ 0001h
CCP1CON_CCP1M1_POSN                      equ 0001h
CCP1CON_CCP1M1_POSITION                  equ 0001h
CCP1CON_CCP1M1_SIZE                      equ 0001h
CCP1CON_CCP1M1_LENGTH                    equ 0001h
CCP1CON_CCP1M1_MASK                      equ 0002h
CCP1CON_CCP1M2_POSN                      equ 0002h
CCP1CON_CCP1M2_POSITION                  equ 0002h
CCP1CON_CCP1M2_SIZE                      equ 0001h
CCP1CON_CCP1M2_LENGTH                    equ 0001h
CCP1CON_CCP1M2_MASK                      equ 0004h
CCP1CON_CCP1M3_POSN                      equ 0003h
CCP1CON_CCP1M3_POSITION                  equ 0003h
CCP1CON_CCP1M3_SIZE                      equ 0001h
CCP1CON_CCP1M3_LENGTH                    equ 0001h
CCP1CON_CCP1M3_MASK                      equ 0008h
CCP1CON_DC1B0_POSN                       equ 0004h
CCP1CON_DC1B0_POSITION                   equ 0004h
CCP1CON_DC1B0_SIZE                       equ 0001h
CCP1CON_DC1B0_LENGTH                     equ 0001h
CCP1CON_DC1B0_MASK                       equ 0010h
CCP1CON_DC1B1_POSN                       equ 0005h
CCP1CON_DC1B1_POSITION                   equ 0005h
CCP1CON_DC1B1_SIZE                       equ 0001h
CCP1CON_DC1B1_LENGTH                     equ 0001h
CCP1CON_DC1B1_MASK                       equ 0020h
CCP1CON_CCP1Y_POSN                       equ 0004h
CCP1CON_CCP1Y_POSITION                   equ 0004h
CCP1CON_CCP1Y_SIZE                       equ 0001h
CCP1CON_CCP1Y_LENGTH                     equ 0001h
CCP1CON_CCP1Y_MASK                       equ 0010h
CCP1CON_CCP1X_POSN                       equ 0005h
CCP1CON_CCP1X_POSITION                   equ 0005h
CCP1CON_CCP1X_SIZE                       equ 0001h
CCP1CON_CCP1X_LENGTH                     equ 0001h
CCP1CON_CCP1X_MASK                       equ 0020h

// Register: CCPR2L
#define CCPR2L CCPR2L
CCPR2L                                   equ 0298h
// bitfield definitions
CCPR2L_CCPR2L_POSN                       equ 0000h
CCPR2L_CCPR2L_POSITION                   equ 0000h
CCPR2L_CCPR2L_SIZE                       equ 0008h
CCPR2L_CCPR2L_LENGTH                     equ 0008h
CCPR2L_CCPR2L_MASK                       equ 00FFh

