GopalSaraf/Practicals/PSDL/include/proc/pic16lf1717.inc
// Register: INLVLC
#define INLVLC INLVLC
INLVLC                                   equ 038Eh
// bitfield definitions
INLVLC_INLVLC0_POSN                      equ 0000h
INLVLC_INLVLC0_POSITION                  equ 0000h
INLVLC_INLVLC0_SIZE                      equ 0001h
INLVLC_INLVLC0_LENGTH                    equ 0001h
INLVLC_INLVLC0_MASK                      equ 0001h
INLVLC_INLVLC1_POSN                      equ 0001h
INLVLC_INLVLC1_POSITION                  equ 0001h
INLVLC_INLVLC1_SIZE                      equ 0001h
INLVLC_INLVLC1_LENGTH                    equ 0001h
INLVLC_INLVLC1_MASK                      equ 0002h
INLVLC_INLVLC2_POSN                      equ 0002h
INLVLC_INLVLC2_POSITION                  equ 0002h
INLVLC_INLVLC2_SIZE                      equ 0001h
INLVLC_INLVLC2_LENGTH                    equ 0001h
INLVLC_INLVLC2_MASK                      equ 0004h
INLVLC_INLVLC3_POSN                      equ 0003h
INLVLC_INLVLC3_POSITION                  equ 0003h
INLVLC_INLVLC3_SIZE                      equ 0001h
INLVLC_INLVLC3_LENGTH                    equ 0001h
INLVLC_INLVLC3_MASK                      equ 0008h
INLVLC_INLVLC4_POSN                      equ 0004h
INLVLC_INLVLC4_POSITION                  equ 0004h
INLVLC_INLVLC4_SIZE                      equ 0001h
INLVLC_INLVLC4_LENGTH                    equ 0001h
INLVLC_INLVLC4_MASK                      equ 0010h
INLVLC_INLVLC5_POSN                      equ 0005h
INLVLC_INLVLC5_POSITION                  equ 0005h
INLVLC_INLVLC5_SIZE                      equ 0001h
INLVLC_INLVLC5_LENGTH                    equ 0001h
INLVLC_INLVLC5_MASK                      equ 0020h
INLVLC_INLVLC6_POSN                      equ 0006h
INLVLC_INLVLC6_POSITION                  equ 0006h
INLVLC_INLVLC6_SIZE                      equ 0001h
INLVLC_INLVLC6_LENGTH                    equ 0001h
INLVLC_INLVLC6_MASK                      equ 0040h
INLVLC_INLVLC7_POSN                      equ 0007h
INLVLC_INLVLC7_POSITION                  equ 0007h
INLVLC_INLVLC7_SIZE                      equ 0001h
INLVLC_INLVLC7_LENGTH                    equ 0001h
INLVLC_INLVLC7_MASK                      equ 0080h

// Register: INLVLD
#define INLVLD INLVLD
INLVLD                                   equ 038Fh
// bitfield definitions
INLVLD_INLVLD0_POSN                      equ 0000h
INLVLD_INLVLD0_POSITION                  equ 0000h
INLVLD_INLVLD0_SIZE                      equ 0001h
INLVLD_INLVLD0_LENGTH                    equ 0001h
INLVLD_INLVLD0_MASK                      equ 0001h
INLVLD_INLVLD1_POSN                      equ 0001h
INLVLD_INLVLD1_POSITION                  equ 0001h
INLVLD_INLVLD1_SIZE                      equ 0001h
INLVLD_INLVLD1_LENGTH                    equ 0001h
INLVLD_INLVLD1_MASK                      equ 0002h
INLVLD_INLVLD2_POSN                      equ 0002h
INLVLD_INLVLD2_POSITION                  equ 0002h
INLVLD_INLVLD2_SIZE                      equ 0001h
INLVLD_INLVLD2_LENGTH                    equ 0001h
INLVLD_INLVLD2_MASK                      equ 0004h
INLVLD_INLVLD3_POSN                      equ 0003h
INLVLD_INLVLD3_POSITION                  equ 0003h
INLVLD_INLVLD3_SIZE                      equ 0001h
INLVLD_INLVLD3_LENGTH                    equ 0001h
INLVLD_INLVLD3_MASK                      equ 0008h
INLVLD_INLVLD4_POSN                      equ 0004h
INLVLD_INLVLD4_POSITION                  equ 0004h
INLVLD_INLVLD4_SIZE                      equ 0001h
INLVLD_INLVLD4_LENGTH                    equ 0001h
INLVLD_INLVLD4_MASK                      equ 0010h
INLVLD_INLVLD5_POSN                      equ 0005h
INLVLD_INLVLD5_POSITION                  equ 0005h
INLVLD_INLVLD5_SIZE                      equ 0001h
INLVLD_INLVLD5_LENGTH                    equ 0001h
INLVLD_INLVLD5_MASK                      equ 0020h
INLVLD_INLVLD6_POSN                      equ 0006h
INLVLD_INLVLD6_POSITION                  equ 0006h
INLVLD_INLVLD6_SIZE                      equ 0001h
INLVLD_INLVLD6_LENGTH                    equ 0001h
INLVLD_INLVLD6_MASK                      equ 0040h
INLVLD_INLVLD7_POSN                      equ 0007h
INLVLD_INLVLD7_POSITION                  equ 0007h
INLVLD_INLVLD7_SIZE                      equ 0001h
INLVLD_INLVLD7_LENGTH                    equ 0001h
INLVLD_INLVLD7_MASK                      equ 0080h

// Register: INLVLE
#define INLVLE INLVLE
INLVLE                                   equ 0390h
// bitfield definitions
INLVLE_INLVLE0_POSN                      equ 0000h
INLVLE_INLVLE0_POSITION                  equ 0000h
INLVLE_INLVLE0_SIZE                      equ 0001h
INLVLE_INLVLE0_LENGTH                    equ 0001h
INLVLE_INLVLE0_MASK                      equ 0001h
INLVLE_INLVLE1_POSN                      equ 0001h
INLVLE_INLVLE1_POSITION                  equ 0001h
INLVLE_INLVLE1_SIZE                      equ 0001h
INLVLE_INLVLE1_LENGTH                    equ 0001h
INLVLE_INLVLE1_MASK                      equ 0002h
INLVLE_INLVLE2_POSN                      equ 0002h
INLVLE_INLVLE2_POSITION                  equ 0002h
INLVLE_INLVLE2_SIZE                      equ 0001h
INLVLE_INLVLE2_LENGTH                    equ 0001h
INLVLE_INLVLE2_MASK                      equ 0004h
INLVLE_INLVLE3_POSN                      equ 0003h
INLVLE_INLVLE3_POSITION                  equ 0003h
INLVLE_INLVLE3_SIZE                      equ 0001h
INLVLE_INLVLE3_LENGTH                    equ 0001h
INLVLE_INLVLE3_MASK                      equ 0008h

// Register: IOCAP
#define IOCAP IOCAP
IOCAP                                    equ 0391h
// bitfield definitions
IOCAP_IOCAP0_POSN                        equ 0000h
IOCAP_IOCAP0_POSITION                    equ 0000h
IOCAP_IOCAP0_SIZE                        equ 0001h
IOCAP_IOCAP0_LENGTH                      equ 0001h
IOCAP_IOCAP0_MASK                        equ 0001h
IOCAP_IOCAP1_POSN                        equ 0001h
IOCAP_IOCAP1_POSITION                    equ 0001h
IOCAP_IOCAP1_SIZE                        equ 0001h
IOCAP_IOCAP1_LENGTH                      equ 0001h
IOCAP_IOCAP1_MASK                        equ 0002h
IOCAP_IOCAP2_POSN                        equ 0002h
IOCAP_IOCAP2_POSITION                    equ 0002h
IOCAP_IOCAP2_SIZE                        equ 0001h
IOCAP_IOCAP2_LENGTH                      equ 0001h
IOCAP_IOCAP2_MASK                        equ 0004h
IOCAP_IOCAP3_POSN                        equ 0003h
IOCAP_IOCAP3_POSITION                    equ 0003h
IOCAP_IOCAP3_SIZE                        equ 0001h
IOCAP_IOCAP3_LENGTH                      equ 0001h
IOCAP_IOCAP3_MASK                        equ 0008h
IOCAP_IOCAP4_POSN                        equ 0004h
IOCAP_IOCAP4_POSITION                    equ 0004h
IOCAP_IOCAP4_SIZE                        equ 0001h
IOCAP_IOCAP4_LENGTH                      equ 0001h
IOCAP_IOCAP4_MASK                        equ 0010h
IOCAP_IOCAP5_POSN                        equ 0005h
IOCAP_IOCAP5_POSITION                    equ 0005h
IOCAP_IOCAP5_SIZE                        equ 0001h
IOCAP_IOCAP5_LENGTH                      equ 0001h
IOCAP_IOCAP5_MASK                        equ 0020h
IOCAP_IOCAP6_POSN                        equ 0006h
IOCAP_IOCAP6_POSITION                    equ 0006h
IOCAP_IOCAP6_SIZE                        equ 0001h
IOCAP_IOCAP6_LENGTH                      equ 0001h
IOCAP_IOCAP6_MASK                        equ 0040h
IOCAP_IOCAP7_POSN                        equ 0007h
IOCAP_IOCAP7_POSITION                    equ 0007h
IOCAP_IOCAP7_SIZE                        equ 0001h
IOCAP_IOCAP7_LENGTH                      equ 0001h
IOCAP_IOCAP7_MASK                        equ 0080h

// Register: IOCAN
#define IOCAN IOCAN
IOCAN                                    equ 0392h
// bitfield definitions
IOCAN_IOCAN0_POSN                        equ 0000h
IOCAN_IOCAN0_POSITION                    equ 0000h
IOCAN_IOCAN0_SIZE                        equ 0001h
IOCAN_IOCAN0_LENGTH                      equ 0001h
IOCAN_IOCAN0_MASK                        equ 0001h
IOCAN_IOCAN1_POSN                        equ 0001h
IOCAN_IOCAN1_POSITION                    equ 0001h
IOCAN_IOCAN1_SIZE                        equ 0001h
IOCAN_IOCAN1_LENGTH                      equ 0001h
IOCAN_IOCAN1_MASK                        equ 0002h
IOCAN_IOCAN2_POSN                        equ 0002h
IOCAN_IOCAN2_POSITION                    equ 0002h
IOCAN_IOCAN2_SIZE                        equ 0001h
IOCAN_IOCAN2_LENGTH                      equ 0001h
IOCAN_IOCAN2_MASK                        equ 0004h
IOCAN_IOCAN3_POSN                        equ 0003h
IOCAN_IOCAN3_POSITION                    equ 0003h
IOCAN_IOCAN3_SIZE                        equ 0001h
IOCAN_IOCAN3_LENGTH                      equ 0001h
IOCAN_IOCAN3_MASK                        equ 0008h
IOCAN_IOCAN4_POSN                        equ 0004h
IOCAN_IOCAN4_POSITION                    equ 0004h
IOCAN_IOCAN4_SIZE                        equ 0001h
IOCAN_IOCAN4_LENGTH                      equ 0001h
IOCAN_IOCAN4_MASK                        equ 0010h
IOCAN_IOCAN5_POSN                        equ 0005h
IOCAN_IOCAN5_POSITION                    equ 0005h
IOCAN_IOCAN5_SIZE                        equ 0001h
IOCAN_IOCAN5_LENGTH                      equ 0001h
IOCAN_IOCAN5_MASK                        equ 0020h
IOCAN_IOCAN6_POSN                        equ 0006h
IOCAN_IOCAN6_POSITION                    equ 0006h
IOCAN_IOCAN6_SIZE                        equ 0001h
IOCAN_IOCAN6_LENGTH                      equ 0001h
IOCAN_IOCAN6_MASK                        equ 0040h
IOCAN_IOCAN7_POSN                        equ 0007h
IOCAN_IOCAN7_POSITION                    equ 0007h
IOCAN_IOCAN7_SIZE                        equ 0001h
IOCAN_IOCAN7_LENGTH                      equ 0001h
IOCAN_IOCAN7_MASK                        equ 0080h

