GopalSaraf/Practicals/PSDL/include/proc/pic16lf1717.inc
// Register: RB3PPS
#define RB3PPS RB3PPS
RB3PPS                                   equ 0E9Bh
// bitfield definitions
RB3PPS_RB3PPS_POSN                       equ 0000h
RB3PPS_RB3PPS_POSITION                   equ 0000h
RB3PPS_RB3PPS_SIZE                       equ 0005h
RB3PPS_RB3PPS_LENGTH                     equ 0005h
RB3PPS_RB3PPS_MASK                       equ 001Fh

// Register: RB4PPS
#define RB4PPS RB4PPS
RB4PPS                                   equ 0E9Ch
// bitfield definitions
RB4PPS_RB4PPS_POSN                       equ 0000h
RB4PPS_RB4PPS_POSITION                   equ 0000h
RB4PPS_RB4PPS_SIZE                       equ 0005h
RB4PPS_RB4PPS_LENGTH                     equ 0005h
RB4PPS_RB4PPS_MASK                       equ 001Fh

// Register: RB5PPS
#define RB5PPS RB5PPS
RB5PPS                                   equ 0E9Dh
// bitfield definitions
RB5PPS_RB5PPS_POSN                       equ 0000h
RB5PPS_RB5PPS_POSITION                   equ 0000h
RB5PPS_RB5PPS_SIZE                       equ 0005h
RB5PPS_RB5PPS_LENGTH                     equ 0005h
RB5PPS_RB5PPS_MASK                       equ 001Fh

// Register: RB6PPS
#define RB6PPS RB6PPS
RB6PPS                                   equ 0E9Eh
// bitfield definitions
RB6PPS_RB6PPS_POSN                       equ 0000h
RB6PPS_RB6PPS_POSITION                   equ 0000h
RB6PPS_RB6PPS_SIZE                       equ 0005h
RB6PPS_RB6PPS_LENGTH                     equ 0005h
RB6PPS_RB6PPS_MASK                       equ 001Fh

// Register: RB7PPS
#define RB7PPS RB7PPS
RB7PPS                                   equ 0E9Fh
// bitfield definitions
RB7PPS_RB7PPS_POSN                       equ 0000h
RB7PPS_RB7PPS_POSITION                   equ 0000h
RB7PPS_RB7PPS_SIZE                       equ 0005h
RB7PPS_RB7PPS_LENGTH                     equ 0005h
RB7PPS_RB7PPS_MASK                       equ 001Fh

// Register: RC0PPS
#define RC0PPS RC0PPS
RC0PPS                                   equ 0EA0h
// bitfield definitions
RC0PPS_RC0PPS_POSN                       equ 0000h
RC0PPS_RC0PPS_POSITION                   equ 0000h
RC0PPS_RC0PPS_SIZE                       equ 0005h
RC0PPS_RC0PPS_LENGTH                     equ 0005h
RC0PPS_RC0PPS_MASK                       equ 001Fh

// Register: RC1PPS
#define RC1PPS RC1PPS
RC1PPS                                   equ 0EA1h
// bitfield definitions
RC1PPS_RC1PPS_POSN                       equ 0000h
RC1PPS_RC1PPS_POSITION                   equ 0000h
RC1PPS_RC1PPS_SIZE                       equ 0005h
RC1PPS_RC1PPS_LENGTH                     equ 0005h
RC1PPS_RC1PPS_MASK                       equ 001Fh

// Register: RC2PPS
#define RC2PPS RC2PPS
RC2PPS                                   equ 0EA2h
// bitfield definitions
RC2PPS_RC2PPS_POSN                       equ 0000h
RC2PPS_RC2PPS_POSITION                   equ 0000h
RC2PPS_RC2PPS_SIZE                       equ 0005h
RC2PPS_RC2PPS_LENGTH                     equ 0005h
RC2PPS_RC2PPS_MASK                       equ 001Fh

// Register: RC3PPS
#define RC3PPS RC3PPS
RC3PPS                                   equ 0EA3h
// bitfield definitions
RC3PPS_RC3PPS_POSN                       equ 0000h
RC3PPS_RC3PPS_POSITION                   equ 0000h
RC3PPS_RC3PPS_SIZE                       equ 0005h
RC3PPS_RC3PPS_LENGTH                     equ 0005h
RC3PPS_RC3PPS_MASK                       equ 001Fh

// Register: RC4PPS
#define RC4PPS RC4PPS
RC4PPS                                   equ 0EA4h
// bitfield definitions
RC4PPS_RC4PPS_POSN                       equ 0000h
RC4PPS_RC4PPS_POSITION                   equ 0000h
RC4PPS_RC4PPS_SIZE                       equ 0005h
RC4PPS_RC4PPS_LENGTH                     equ 0005h
RC4PPS_RC4PPS_MASK                       equ 001Fh

// Register: RC5PPS
#define RC5PPS RC5PPS
RC5PPS                                   equ 0EA5h
// bitfield definitions
RC5PPS_RC5PPS_POSN                       equ 0000h
RC5PPS_RC5PPS_POSITION                   equ 0000h
RC5PPS_RC5PPS_SIZE                       equ 0005h
RC5PPS_RC5PPS_LENGTH                     equ 0005h
RC5PPS_RC5PPS_MASK                       equ 001Fh

// Register: RC6PPS
#define RC6PPS RC6PPS
RC6PPS                                   equ 0EA6h
// bitfield definitions
RC6PPS_RC6PPS_POSN                       equ 0000h
RC6PPS_RC6PPS_POSITION                   equ 0000h
RC6PPS_RC6PPS_SIZE                       equ 0005h
RC6PPS_RC6PPS_LENGTH                     equ 0005h
RC6PPS_RC6PPS_MASK                       equ 001Fh

// Register: RC7PPS
#define RC7PPS RC7PPS
RC7PPS                                   equ 0EA7h
// bitfield definitions
RC7PPS_RC7PPS_POSN                       equ 0000h
RC7PPS_RC7PPS_POSITION                   equ 0000h
RC7PPS_RC7PPS_SIZE                       equ 0005h
RC7PPS_RC7PPS_LENGTH                     equ 0005h
RC7PPS_RC7PPS_MASK                       equ 001Fh

// Register: RD0PPS
#define RD0PPS RD0PPS
RD0PPS                                   equ 0EA8h
// bitfield definitions
RD0PPS_RD0PPS_POSN                       equ 0000h
RD0PPS_RD0PPS_POSITION                   equ 0000h
RD0PPS_RD0PPS_SIZE                       equ 0005h
RD0PPS_RD0PPS_LENGTH                     equ 0005h
RD0PPS_RD0PPS_MASK                       equ 001Fh

// Register: RD1PPS
#define RD1PPS RD1PPS
RD1PPS                                   equ 0EA9h
// bitfield definitions
RD1PPS_RD1PPS_POSN                       equ 0000h
RD1PPS_RD1PPS_POSITION                   equ 0000h
RD1PPS_RD1PPS_SIZE                       equ 0005h
RD1PPS_RD1PPS_LENGTH                     equ 0005h
RD1PPS_RD1PPS_MASK                       equ 001Fh

// Register: RD2PPS
#define RD2PPS RD2PPS
RD2PPS                                   equ 0EAAh
// bitfield definitions
RD2PPS_RD2PPS_POSN                       equ 0000h
RD2PPS_RD2PPS_POSITION                   equ 0000h
RD2PPS_RD2PPS_SIZE                       equ 0005h
RD2PPS_RD2PPS_LENGTH                     equ 0005h
RD2PPS_RD2PPS_MASK                       equ 001Fh

// Register: RD3PPS
#define RD3PPS RD3PPS
RD3PPS                                   equ 0EABh
// bitfield definitions
RD3PPS_RD3PPS_POSN                       equ 0000h
RD3PPS_RD3PPS_POSITION                   equ 0000h
RD3PPS_RD3PPS_SIZE                       equ 0005h
RD3PPS_RD3PPS_LENGTH                     equ 0005h
RD3PPS_RD3PPS_MASK                       equ 001Fh

// Register: RD4PPS
#define RD4PPS RD4PPS
RD4PPS                                   equ 0EACh
// bitfield definitions
RD4PPS_RD4PPS_POSN                       equ 0000h
RD4PPS_RD4PPS_POSITION                   equ 0000h
RD4PPS_RD4PPS_SIZE                       equ 0005h
RD4PPS_RD4PPS_LENGTH                     equ 0005h
RD4PPS_RD4PPS_MASK                       equ 001Fh

